# กรณี 1 print() มีข้อมูลหลายประเภท 4 วิธี
# วิธีที่ 1 ใช้ , ()
print ('Hello',456,'wow',999,'Hi',450+70)

# วิธ๊ที่ 2 ใช้ + (ข้อมูลไหนที่ไม่ใช่ String ต้องทำให้เป็น String ใช้ฟังก์ชัน str())
print('Hello'+str(456)+'Hi'+str(789)+'Huu'+str(45+5*7))
print('Hello '+str(567))

# วิธีที่ 3 ใช้ ใช้เมธอด format() โดยข้อมูลที่แสดงอยู่ในรูปของ string
# (ข้อมูลที่ไม่ใช่ string ให้ไปใส่ใน()ของ format และตำแหน่งที่แสดงข้อมูลนั้นให้ใส่() แทน )
print('Hello {} Wow {} {} {} '.format(555,666,True,10+50))

# index number          0   1   2   3   4 
print('{4} {2}'.format('a','b','c','d','e'))

# วิธีที่ 4 ใช้ f-string โดยข้อมูลที่แสดงอยู่ในรูปแบบของ string โดยมี f อยู่ข้างหน้า
# (ข้อมูลที่ไม่ใช้ string ให้เขียนใส่ใน {} ณ ตำแหน่งนั้นๆเลย)
print(f'hello {555} wow {999} {True} Hi {10+5+15} {152.45}')