#โปรแกรมคำนวณค่าคอมมิชชั่นของพนักงานขาย โดยป้อนรหัสพนักงาน ชื่อพนักงาน และจำนวนเงินซึ่งเป็นยอดขายของพนักงาน จากผู้ใช้ทางแป้นพิมพ์ และคำนวณค่าคอมมิชชั่น จากเงื่อนไข ดังนี้
     #ขายของได้ไม่เกิน 1000 บาท ค่าคอมมิชชั่น เป็น 0.0 บาท
     #ขายของได้ตั้งแต่ 1001 – 2000  บาท ค่าคอมมิชชั่นคิด 	1% จากยอดขาย
     #ขายของได้ตั้งแต่ 2001 – 3000  บาท ค่าคอมมิชชั่นคิด 	3% จากยอดขาย
     #ขายของได้ตั้งแต่ 3001  บาท ขึ้นไป ค่าคอมมิชชั่นคิด 	5% จากยอดขาย

print('-------------------------------')
print('โปรแกรมคำนวณค่าคอมมิชชั่นของพนักงานขาย')
print('--------------------------------')

user_id = input('ป้อนรหัสพนักงาน : ')
user_name = input('ป้อนชื่อพนักงาน : ')
money = float(input('ป้อนจํานวนเงิน : '))

if money <= 1000:
    commission = 0
elif 1001 <= money <= 2000:
    commission = money * 1 / 100
elif 2001 <= money <= 3000:
    commission = money * 3 / 100
else: 
    commission = money * 5 / 100

print(f'รหัสพนักงาน : {user_id}')
print(f'ชื่อพนักงาน : {user_name}')
print(f'จํานวนเงิน : {money}')
print(f'ค่าคอมมิชชั่น : {commission}')